#include<stdio.h>
int main() {
    int a = 16;
    printf("%d, ", a);      // 16
    printf("%o, ", a);      // 20
    printf("%x, ", a);      // 10

    int b = 17;
    printf("\n%d, ", b);    // 17
    printf("%o, ", b);      // 21
    printf("%x, ", b);      // 11
    return 0;
}


// Solving
// %o, %x 는 각각 8진수 16진수
// 푸는 과정 : 각 변수의 숫자를 2진수로 바꾸기 -> 8, 16진수로 변환
// 1. a : a(10000) => 8진수 ( 010 | 000 => 20) / 16진수 ( 0001 | 0000 => 10)
// 2. b : b(10001) => 8진수 ( 010 | 001 => 21) / 16진수 ( 0001 | 0001 => 11)